
set search_path ../source
set target_library  ../ref/models/saed90nm_typ_ht.db
set link_library ../ref/models/saed90nm_typ_ht.db

read_file -format sverilog {/home/thanh/lab2_sxxxxxxx/dc/source/counter.sv}
analyze -library WORK -format sverilog {/home/thanh/lab2_sxxxxxxx/dc/source/counter.sv}
elaborate counter -architecture verilog -library DEFAULT
link
check_design
create_clock [get_ports clk]  -period 20
set_clock_uncertainty 0.4  [get_clocks clk]
set_clock_transition -rise 0.8 [get_clocks clk]
set_clock_transition -fall 0.8 [get_clocks clk]
set_input_delay -clock clk  0.85  [get_ports rst]
set_output_delay -clock clk  8  [get_ports out]
set_load -pin_load 0.004 [get_ports out]
set_max_area 0
compile_ultra -exact_map
report_cell
report_area
report_qor
write_sdc ../results/counter.sdc
write -format verilog -o ../results/counter_syn.sv



